app/views/plantes/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    <% end %>
    <p>Seller: <%= @plante.user.first_name %></p>