app/views/requests/index.html.erb

                <h4>Status</h4>
                <p>Seller: <strong><%= request.plante.user.first_name %></strong></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 8], ["LIMIT", 1]]