app/controllers/plantes_controller.rb

SELECT "plantes".* FROM "plantes"
---
  def index
    @plantes = Plante.all

SELECT "plantes".* FROM "plantes" WHERE "plantes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @plante = Plante.find(params[:id])

INSERT INTO "plantes" ("name", "price", "variety", "created_at", "updated_at", "user_id", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Pothos"], ["price", 10.0], ["variety", "hh"], ["created_at", "2023-08-22 21:04:27.040151"], ["updated_at", "2023-08-22 21:04:27.040151"], ["user_id", 8], ["description", "hh"]]
---
  def create
    @plante = Plante.new(plante_params)
    @plante.user = current_user
    if @plante.save