app/controllers/requests_controller.rb

INSERT INTO "requests" ("created_at", "updated_at", "plante_id", "user_id", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2023-08-23 18:35:35.650124"], ["updated_at", "2023-08-23 18:35:35.650124"], ["plante_id", 32], ["user_id", 8], ["status", nil]]
---
  def create
    @request = Request.new(user: current_user, plante: @plante)
    if @request.save

SELECT "plantes".* FROM "plantes" WHERE "plantes"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
---
  def set_plante
    @plante = Plante.find(params[:plante_id])